andrewaarestad/groundstationfw/firmware/Microchip/Include/MFI/I2C dsPIC33E/i2c.h
/*******************************************************************************
  I2C Library Interface Definition

  Summary:
    This file contains the Application Program Interface (API) definition  for
    the I2C peripheral library.

  Description:
    This library provides a low-level abstraction of the I2C (Inter-Integrated
    Circuit) module on Microchip PIC32MX family microcontrollers with a
    convenient C language interface.  It can be used to simplify low-level
    access to the module without the necessity of interacting directly with the
    module's registers, thus hiding differences from one microcontroller
    variant to another.
*******************************************************************************/
//DOM-IGNORE-BEGIN
/*******************************************************************************
FileName:       i2c.h
Processor:      dsPIC33E
Compiler:       Microchip MPLAB C30 v3.30 or higher

Copyright © 2011 released Microchip Technology Inc.  All rights
reserved.

Microchip licenses to you the right to use, modify, copy and distribute
Software only when embedded on a Microchip microcontroller or digital signal
controller that is integrated into your product or third party product
(pursuant to the sublicense terms in the accompanying license agreement).

You should refer to the license agreement accompanying this Software for
additional information regarding your rights and obligations.

SOFTWARE AND DOCUMENTATION ARE PROVIDED “AS IS” WITHOUT WARRANTY OF ANY KIND,
EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF
MERCHANTABILITY, TITLE, NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER
CONTRACT, NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR
OTHER LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE OR
CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT OF
SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
(INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.
*******************************************************************************/
//DOM-IGNORE-END

#ifndef _I2C_H_
#define _I2C_H_

#if defined( __C30__ )
    #if defined(__PIC24F__) || defined(__PIC24FK__)     // Microchip C30 compiler
        // PIC24F processor
        #include <p24Fxxxx.h>
        #include "PIC24F_periph_features.h"
    #elif defined(__PIC24H__)   // Microchip C30 compiler
        // PIC24H processor
        #include <p24Hxxxx.h>
    #elif defined(__dsPIC33F__) // Microchip C30 compiler
        // dsPIC33F processor
        #include <p33Fxxxx.h>
    #elif defined(__dsPIC30F__) // Microchip C30 compiler
        // dsPIC30F processor
        #include <p30fxxxx.h>
    #elif defined(__PIC24E__)   // Microchip C30 compiler
        // PIC24E processor
        #include <p24Exxxx.h>
    #elif defined(__dsPIC33E__) // Microchip C30 compiler
        // dsPIC33E processor
        #include <p33Exxxx.h>
    #else
        #include <p30sim.h>
        #define LIB_BUILD
    #endif
#endif

#include <GenericTypeDefs.h>

//#ifndef _PLIB_DISABLE_LEGACY
//    #include "i2c original.h"  // Legacy definitions, do not use
//#endif


// *****************************************************************************
// *****************************************************************************
// Section: Peripheral Definitions
// *****************************************************************************
// *****************************************************************************

// These devices have an I2C1 module.
#if defined(_I2C1MD)
    #define _I2C1
    #define _I2C1_BASE_ADDRESS                       0x0200
#else
    #error This device has no I2C support.
#endif

// These devices have an I2C2 module.
#if defined(_I2C2MD)
    #define _I2C2
    #define _I2C2_BASE_ADDRESS                       0x0210
#endif

// *****************************************************************************
// *****************************************************************************
// Section: Constants & Data Types
// *****************************************************************************
// *****************************************************************************

/* I2C Module

  Summary:
    I2C Modules Supported.

  Description:
    This enumeration identifies the available I2C modules.

  Remarks:
    The caller should not rely on the specific numbers assigned to any of
    these values as they may change from one processor ot the next.

    Not all modules will be available on all microcontrollers.  Refer to the
    data sheet for the specific controller in use.
*/

typedef enum
{

#ifdef _I2C1
    // I2C Module 1 ID
    I2C1,
#endif

#ifdef _I2C2
    // I2C Module 2 ID
    I2C2,
#endif

    // Number of available I2C modules.
    I2C_NUMBER_OF_MODULES

} I2C_MODULE;


// *****************************************************************************
/* I2C 7-Bit Address

  Summary:
    Structure of a 7-bit I2C address.

  Description:
    This union defines the format of a 7-bit I2C slave address.
*/

typedef union
{
    // Access to the 8-bit format with the 7-bit address and the read/write
    // direction defined.
    UINT8       byte;

    struct
    {
        // The read/write bit of the I2C address.
        UINT8   rw       : 1;

        // The 7-bit slave address.
        UINT8   address  : 7;
    };

} I2C_7_BIT_ADDRESS;


// *****************************************************************************
/* I2C 10-Bit Address

  Summary:
    Structure of a 10-bit I2C address.

  Description:
    This union defines the format of a 10-bit I2C slave address.
*/

typedef union
{
    // Access to the 16-bit format.
    UINT16      both_bytes;

    struct
    {
        // Access to the first byte.
        BYTE    first_byte;

        // Access to the second byte.
        BYTE    second_byte;
    };

    struct
    {
        // The read/write bit of the I2C address.
        UINT16  rw          : 1;

